USE university;

INSERT INTO faculty (id, name_faculty)
VALUE 	(1, 'ФИиВТ'),
		(2, 'ИВТ'),
        (3, 'БИС');

INSERT INTO class (id, name_class, name_faculty)
VALUE 	(1, 'ПС-11', 'ФИиВТ'),
		(2, 'ПС-12', 'ФИиВТ'),
        (3, 'ПС-13', 'ФИиВТ'),
		(4, 'ИВТ-11', 'ИВТ'),
        (5, 'ИВТ-12', 'ИВТ'),
        (6, 'ИВТ-13', 'ИВТ'),
        (7, 'БИС-11', 'БИС'),
        (8, 'БИС-12', 'БИС'),
        (9, 'БИС-13', 'БИС');

INSERT INTO student (id, name, surename, age, name_class)
VALUE 	(1, 'Иван',			'Иванов',		19, 'ПС-11'),
		(2, 'Елизавета',	'Грачева',		18, 'ПС-11'),
        (3, 'Софья',		'Коновалова',	17, 'ПС-11'),
        (4, 'Илья',			'Захаров',		18, 'ПС-11'),
        (5, 'Татьяна',		'Абрамова',		18, 'ПС-11'),
        (6, 'Дмитрий',		'Шилов',		19, 'ПС-12'),
        (7, 'Екатерина',	'Степановна',	19, 'ПС-12'),
        (8, 'Ангелина',		'Басова',		21, 'ПС-12'),
        (9, 'Александра',	'Соловьёва',	20, 'ПС-12'),
        (10, 'Анастасия',	'Филиппова',	20, 'ПС-12'),
        (11, 'Демид',		'Еремеев',		21, 'ПС-13'),
        (12, 'Павел',		'Чухланцев',	18, 'ПС-13'),
        (13, 'Демид',		'Федотов',		18, 'ПС-13'),
        (14, 'Тимур',		'Антонов',		19, 'ПС-13'),
        (15, 'Юлия',		'Баранова',		19, 'ПС-13'),
        (16, 'Софья', 		'Петрова',		19, 'ИВТ-11'),
        (17, 'Демид',		'Андреев',		20, 'ИВТ-11'),
        (18, 'Мария',		'Кузнецова',	17, 'ИВТ-11'),
        (19, 'Карина',		'Львова',		17, 'ИВТ-11'),
        (20, 'Виктор',		'Козлов',		18, 'ИВТ-11'),
        (21, 'Матвей',		'Федотов',		18, 'ИВТ-12'),
        (22, 'Иван',		'Фролов',		18, 'ИВТ-12'),
        (23, 'Макар',		'Пономарев',	19, 'ИВТ-12'),
        (24, 'Иван',		'Овсяников',	19, 'ИВТ-12'),
        (25, 'Максим',		'Семенов',		19, 'ИВТ-12'),
        (26, 'Елизавета',	'Латышева',		20, 'ИВТ-13'),
        (27, 'Арсений',		'Пирогов',		20, 'ИВТ-13'),
        (28, 'Ярослав',		'Яковлев',		21, 'ИВТ-13'),
        (29, 'Тимовей',		'Андреев',		21, 'ИВТ-13'),
        (30, 'Платон',		'Захаров',		18, 'ИВТ-13'),
        (31, 'Ярослав',		'Степанов',		18, 'БИС-11'),
        (32, 'Злата',		'Антонова',		18, 'БИС-11'),
        (33, 'Кристина',	'Широкова',		18, 'БИС-11'),
        (34, 'Андрей',		'Корнеев',		17, 'БИС-11'),
        (35, 'Кирилл',		'Кулаков',		17, 'БИС-11'),
        (36, 'Майя',		'Игнатова',		19, 'БИС-12'),
        (37, 'Михаил',		'Соколов',		19, 'БИС-12'),
        (38, 'Роман',		'Барсуков',		18, 'БИС-12'),
        (39, 'Марьям',		'Котова',		18, 'БИС-12'),
        (40, 'Алиса',		'Столярова',	17, 'БИС-12'),
        (41, 'Николь',		'Ефимова',		20, 'БИС-13'),
        (42, 'Роберт',		'Севастьянов',	21, 'БИС-13'),
        (43, 'Сергей',		'Белов',		19, 'БИС-13'),
        (44, 'Аделина',		'Павлова',		19, 'БИС-13'),
        (45, 'Никита',		'Булатов',		19, 'БИС-13');

-- SELECT * FROM faculty;
-- SELECT * FROM class;
-- SELECT * FROM student;